module.exports = [
    {
        area:'北島 - オークランド',
        location: {
            lat: -36.858461, 
            lng: 174.763336
        }
    },
    {
        area:'北島 - ウェリントン',
        location: {
            lat: -41.28664, 
            lng: 174.77557
        }
    },
    {
        area:'南島 - クライストチャーチ',
        location: {
            lat:  -43.525650, 
            lng: 172.639847
        }
    }
]

// const areas = [
//     ['北島', 'オークランド'],
//     ['北島', 'ウェリントン'],
//     ['北島', 'タウポ'],
//     ['北島', 'タウランガ'],
//     ['北島', 'ニュープリマス'],
//     ['北島', 'ネイピア'],
//     ['北島', 'パーマストンノース'],
//     ['北島', 'ハミルトン'],
//     ['北島', 'ファンガレイ'],
//     ['北島', 'ロトルア'],
//     ['北島', 'ワンガヌイ'],
//     ['北島', 'その他'],
//     ['南島', 'クライストチャーチ'],
//     ['南島', 'クイーンズタウン'],
//     ['南島', 'ダニーデン'],
//     ['南島', 'テカポ'],
//     ['南島', 'ネルソン'],
//     ['南島', 'ワナカ'],
//     ['南島', 'その他'],
// ]
