import React from 'react'

export default function Privacy() {
    return (
        <div className="privacy">
            <h1>個人情報保護方針</h1>
            <p>管理者は、当サービスの運用において、会員から提供されたメールアドレス等の個人情報の取り扱いについて細心の注意を払います。</p>

            <h2>個人情報の提供・開示について</h2>
            <p>管理者は、保有する利用者の個人情報について、利用者の事前の同意を得ずに本来の目的以外の目的でこれを利用することはありません。また、利用者の個人情報を他の業者等に提供することもありません。</p>
            <p>
                ただし、法令等に基づき提供に応じなければならない等、やむを得ない場合にはこの限りではございません。</p>
            <h2>登録情報の利用目的</h2>
            <p>当サービスを利用する際に提供された個人情報は、以下の用途で使用されます。</p>
            <ol>
                <li>パスワード再発行</li>
                <li>規約違反行為が見受けられた際の警告メール</li>
                <li>お問い合わせに対する返答</li>
            </ol>
            <p>
                登録に使用したメールアドレスが当サイト上に表示される事はございません。
            </p>

            <h2>クッキーについて</h2>
            <p>当サービスにはクッキーを利用しているものがあります。クッキーは、ウェブサイトが閲覧者のブラウザに一定の情報を保存する仕組です。これらの情報は個人を特定するものでは無く、当サービスへのアクセス情報を分析することにより、サービスの改善に役立てております。</p>
            <p>閲覧者は、クッキーの使用禁止やクッキーが使われたことを毎回閲覧者に知らせる設定をブラウザで行なうことができます。</p>
            <h2>Twitter 連携について</h2>
            <p>当サービスは、Twitter 連携を用いたゆざーアカウント作成機能を備えています。</p>
            <p>その際、お客様から以下の情報を取得する場合が有ります。</p>
            <ol>
                <li>Twitter ID</li>
                <li>ユーザーネーム</li>
                <li>プロフィール画像</li>
            </ol>
            <br />
            <p>2020年 1月9日制定</p>
        </div>
    )
}
