import React from 'react'

const Terms = () => {
    return (
        <div className="terms">
            <h1>利用規約</h1>
            <h2>第一条：定義</h2>
            <ol>
                <li>「管理者」とは、本サービスの開発・提供者の事を指します。</li>
                <li>「利用者」とは、ユーザー登録の有無にかかわらず、本サービス利用するすべての方をいいます。</li>
                <li>「登録者」とは、本規約の定めに基づき、本サービスの会員ユーザー登録を行った方をいいます。</li>
                <li>「本サービス」とは、当ウェブアプリケーションにおいて提供するすべてのサービスをいいます。 </li>
            </ol>
            <h2>【第二条：本規約への同意】</h2>
            <ol>
                <li>利用者は、本利用規約に同意頂いた上で、本サービスを利用できるものとします。</li>
                <li>本利用規約は、登録者を含む利用者に適用されるものとし、利用者は本利用規約を遵守するものとします。</li>
            </ol>

            <h2>第三条：規約の変更</h2>
            <p>当社は、利用者の承諾を得ることなく、いつでも本規約の内容を改定することができるものとし、利用者はこれを異議なく承諾するものとします。</p>
            <p>本規約を変更した場合、サイト上で通知をいたしますが、当サイトに関する一切の事項は変更後の規約によるものとします。</p>


            <h2>第四条：会員登録</h2>
            <ol>
                <li>本サービスは一部機能においてユーザー登録をせずにご利用いただくことも可能ですが、全ての機能を利用する際には会員ユーザー登録が必要となります。</li>
                <li>ユーザー登録はオンライン上でパスワード、および利用可能なEメールアドレスをオンライン上で登録する事により行われることとします。</li>
                <li>登録者が利用規約に違反した場合、当該利用者に何ら通知することなくして、本サービスの一部および全部の利用制限または会員登録の取り消しを行い、以降一切の本サービス利用を拒否する事があります。 なお、その理由について一切開示義務を負いません。また、本サービス利用をお断りすることにより利用者または第三者が被った損害に関し、管理者は一切の責任を負いません。</li>
            </ol>
            <h2>第五条：サービスの中断・停止</h2>
            <p>管理者は、以下の事由が発生した場合、利用者に事前に通知することなく、本サービスの全部又は一部の提供を中断することがあります。それによって利用者または登録者が損害を被った場合であっても、管理者は一切責任を負いません。</p>
            <ol>
                <li>本サービスにかかるシステムの保守又は点検</li>
                <li>本サービスにかかるシステムの障害</li>
                <li>電気通信インフラの障害による提供不能</li>
                <li>地震、津波等の天災事変の発生</li>
                <li>戦争、動乱、暴動、騒乱、労働争議等による提供不能</li>
                <li>その他、管理者が本サービスの一時中断が必要と判断した場合</li>
            </ol>

            <h2>第六条：アカウントの管理</h2>
            <ol>
                <li>利用者は、利用に際して登録した情報（以下、「登録情報」といいます。メールアドレス・パスワード等を含みます）について、自己の責任の下、任意に登録、管理するものとします。利用者は、これを第三者に利用させ、または貸与、譲渡、名義変更、売買などをしてはならないものとします。</li>
                <li>管理者は、登録情報によって本サービスの利用があった場合、利用登録をおこなった本人が利用したものと扱うことができ、当該利用によって生じた結果ならびにそれに伴う一切の責任については、利用登録を行った本人に帰属するものとします。 </li>
                <li>利用者は、登録情報の不正使用によって管理者または第三者に損害が生じた場合、管理者および第三者に対して、当該損害を賠償するものとします。</li>
                <li>登録情報の管理は、利用者が自己の責任の下で行うものとし、登録情報が不正確または虚偽であったために利用者が被った一切の不利益および損害に関して、管理者は責任を負わないものとします。 </li>
                <li>登録情報が盗用されまたは第三者に利用されていることが判明した場合、利用者は直ちにその旨を管理者に通知するとともに、管理者からの指示に従うものとします。</li>
                <li>登録者は、定期的にパスワードを変更する義務があるものとし、その義務を怠ったことにより損害が生じても管理者は一切責任を負いません。</li>

            </ol>
            <h2>第七条：禁止行為</h2>
            <p>本サービスの利用に際し、管理者は、利用者に対し、次に掲げる行為を禁止します。管理者において、利用者が禁止事項に違反したと認めた場合、利用者用の一時停止、退会処分その他管理者が必要と判断した措置を取ることができます。 </p>
            <ol>
                <li>管理者または第三者の著作権等の知的財産権、肖像権、プライバシーの権利、その他の権利または利益を侵害する行為</li>
                <li>管理者または第三者の名誉・信用を毀損または不当に差別もしくは誹謗中傷する行為</li>
                <li>管理者または第三者の財産を侵害する行為、または侵害する恐れのある行為 </li>
                <li>管理者または第三者に経済的損害を与える行為</li>
                <li>管理者または第三者に対する脅迫的な行為</li>
                <li>犯罪行為、および犯罪を助長する一切の行為</li>
                <li>法令または公序良俗に違反するまたは違反するおそれのある行為</li>
                <li>マルチ商法、マルチまがい商法、ネットワークビジネス関連の勧誘・宣伝行為</li>
                <li>宗教への勧誘・宣伝行為</li>
                <li>コンピューターウィルス、有害なプログラムを仕様またはそれを誘発する行為</li>
                <li>本サービス用インフラ設備に対して過度な負担となるストレスをかける行為</li>
                <li>当サイトのサーバーやシステム、セキュリティへの攻撃</li>
                <li>管理者提供のインターフェース以外の方法で当サービスにアクセスを試みる行為</li>
                <li>上記の他、管理者が不適切と判断する行為</li>
            </ol>
            <h2>第八条：ブログ情報の取り扱い</h2>
            <p>登録者は本サービスにおいて個人ブログ等のリンクを登録し、サイト上に一部コンテンツを表示する事が可能です。ただしリンク先が以下の情報・内容・表現を含む場合において、管理者は該当リンク情報の削除を事前通告なしに行えるものとします。</p>
            <ol>
                <li>上記第6条の禁止行為に該当する内容</li>
                <li>アフィリエイトなどの成果報酬などによる収入のみが目的と思われるサイトでの参加や勧誘行為 </li>
                <li>通信販売、ドロップシップなどによる販売のみが目的と思われるサイトでの商品紹介行為 </li>
                <li>リダイレクトページやドアウェイページ(その他の場所に転送されるサイト)など自動、手動を問わず他のサイトへの移動を主目的としたサイト、または類似する内容</li>
                <li>民族的もしくは人種的な差別発言</li>
                <li>その他、管理者が不適当と認めた情報および内容・表現、不正行為</li>
            </ol>
            <h2>第九条：著作権</h2>
            <ol>
                <li>
                    利用者は，自ら著作権等の必要な知的財産権を有するか，または必要な権利者の許諾を得た文章，画像や映像等の情報のみ，本サービスを利用し，投稿または編集することができるものとします。
                </li>
                 <li>
                    利用者が本サービスを利用して投稿または編集した文章，画像，映像等の著作権については，当該利用者その他既存の権利者に留保されるものとします。ただし，当社は，本サービスを利用して投稿または編集された文章，画像，映像等を利用できるものとし，利用者は，この利用に関して，著作者人格権を行使しないものとします。
                </li>
                <li>
                    前項本文の定めるものを除き，本サービスおよび本サービスに関連する一切の情報についての著作権およびその他知的財産権はすべて当社または当社にその利用を許諾した権利者に帰属し，利用者は無断で複製，譲渡，貸与，翻訳，改変，転載，公衆送信（送信可能化を含みます。），伝送，配布，出版，営業使用等をしてはならないものとします。
                </li>
            </ol>
            <h2>第十条：免責事項</h2>
            <ol>
                <li>管理者は、本サービスの内容変更、中断、終了によって生じたいかなる損害についても、一切責任を負いません。</li>
                <li>管理者は、利用者の本サービスの利用環境について一切関与せず、また一切の責任を負いません。</li>
                <li>管理者は、本サービスが全ての情報端末に対応していることを保証するものではなく、本サービスの利用に供する情報端末のＯＳのバージョンアップ等に伴い、本サービスの動作に不具合が生じる可能性があることにつき、利用者はあらかじめ了承するものとします。管理者は、かかる不具合が生じた場合に管理者が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。</li>
                <li>管理者は、画像、テキスト等を含む当サービスにアップロードされた素材、及び付随する情報等のデータ一切に関する損失・損害について、一切責任を負いません。登録者は、当該データのバックアップを自身で作成し、維持するものとします。</li>
                <li>管理者は、本サービスを利用したことにより直接的または間接的に利用者に発生した損害について、一切賠償責任を負いません。</li>
                <li>利用者と他の利用者との間の紛争及びトラブルについて、管理者は一切責任を負わないものとします。利用者と他の利用者でトラブルになった場合でも、両者同士の責任で解決するものとし、管理者には一切の請求をしないものとします。</li>
                <li>利用者は、本サービスの利用に関連し、他の利用者に損害を与えた場合または第三者との間に紛争を生じた場合、自己の費用と責任において、かかる損害を賠償またはかかる紛争を解決するものとし、管理者には一切の迷惑や損害を与えないものとします。</li>
            </ol>
            <h2>第十一条：広告の掲載について</h2>
            <p>利用者は、本サービス上にあらゆる広告が含まれる場合があること、管理者またはその提携先があらゆる広告を掲載する場合があることを理解しこれを承諾したものとみなします。本サービス上の広告の形態や範囲は、管理者によって随時変更されます。 </p>


            <p>以上</p>
            <br />
            <p>2019年 9月6日制定</p>
        </div >
    )
}

export default Terms;
